Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/datatilsynet.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: We aim for project start in November.
nb: Vi statser på prosjektoppstart i løpet av november.

source: Analyse components, access points, data flow and processing of data in the software.
nb: Analyserer komponenter, tilgangspunkter, dataflyt og prosessflyt i programvaren.

source: Employees should be trained in which tools they can use, how to use them, and for what purposes.
nb: De ansatte bør få opplæring i hvilke verktøy de kan bruke, hvordan og til hva.

source: Examples of tools for static code analysis:
nb: Eksempel på verktøy for statisk kodeanalyse:

source: This is important for performing support tasks, and will help to reduce long-term costs related to software management and maintenance.
nb: Dette er viktig for å utføre supportoppgaver og vil bidra til å redusere langsiktige kostnader knyttet til forvaltning og vedlikehold.

source: In order to ensure data protection, it is important to map where in the software personal data is stored.
nb: For å ivareta personvernet er det viktig å kartlegge hvor personopplysninger lagres.

source: If such a situation results in an alert being entered in SIS II, it can cause difficulties for the innocent person whose identity has been stolen.
nb: Hvis du mener at personopplysningene dine er blitt misbrukt, kan du søke om innsyn i ethvert Schengen-land ved å ta kontakt med myndighetene som har ansvaret for kvaliteten på opplysningene som registreres i SIS II i landet det gjelder.

source: o use groupings rather than individuals
nb: o bruk grupperinger fremfor enkeltpersoner

source: The organisation should establish a plan for managing incidents relating to the software.
nb: Virksomheten må etablere en plan for å håndtere hendelser relatert til programvaren.

source: The plan should be updated regularly, and the company should define which triggers require updating.
nb: Planen bør oppdateres regelmessig og virksomheten bør definere hvilke triggere som krever oppdatering.

source: an assessment of the risks to the rights and freedoms of the data subjects, and
nb: En vurdering av risikoen for rettigheter og friheter til registrerte.

source: The review should be based on previous reviews during the development process, and be included in the control gates that must be carried out prior to release.
nb: Gjennomgangen skal baseres på tidligere gjennomganger i utviklingsløpet og inngå i de kontrollpunkter (control gates) som må gjøres før produksjonssetting.

source: Which requirements apply for the organisation?
nb: Hvilke krav gjelder for virksomheten?

source: Users expect services to both be secure and safeguard their privacy in an effective manner.
nb: Brukerne forventer at tjenester både er sikre og ivaretar personvernet på en god måte.

source: To ensure consistent practice, a list of approved and permitted tools, processes, and frameworks for software development and roll-out must be defined and documented.
nb: For å sikre en enhetlig praksis bør det defineres og publiseres en liste over godkjente og tillatte verktøy, prosesser og rammeverk for programvareutvikling og utrulling.

source: An analysis should be performed on all functions, APIs, third-party libraries and modules used during software development.
nb: Det bør gjøres en analyse av alle funksjoner, API-er, tredjepartsbibliotek og moduler som brukes i programvareutviklingen.

source: For example, you should consider the level of detailed information required, how long the data will need to be stored, whether automatic deletion routines can be implemented, where the data will be stored, and who will have access to the data, and from where.
nb: For eksempel bør dere vurdere hvor detaljerte opplysninger det er behov for, om det er nødvendig med historikk, hvor lenge opplysningene må lagres, om automatiske sletterutiner kan gjennomføres, hvor opplysningene skal lagres, og hvem som skal ha tilgang til opplysningene og fra hvor.

source: This applies, for example, to cardiovascular disease, cancer and dementia.
nb: Dette gjelder for eksempel hjerte- og karsykdommer, kreft og demens.

source: in using the Facebook page when these interests are
nb: Facebook Irelands ledende tilsynsmyndighet, Irish Data

source: o The data subject may request that personal data be exported and delivered in
nb: o Den registrerte kan be om at personopplysninger eksporteres og overleveres på en

source: It is important to consider which communication channels should be used to report incidents.
nb: Det er viktig å vurdere hvilke kanaler som brukes for å varsle hendelser.

source: Implement and operate a plan for incident response
nb: Etabler og utøv plan for hendelseshåndtering (gjort i

source: Handling incidents and data breaches
nb: Håndtere hendelser og avvik

source: Below are some examples of sandbox activities we can offer:
nb: Her er noen typer aktiviteter vi kan tilby i sandkassa:

source: Establish business routines and/or checklists for static analysis and code review.
nb: Etabler virksomhetsrutiner og/eller -sjekklister for statisk analyse og gjennomgang av kode.

source: They are developing the Mitt Fagkart application.
nb: De utvikler applikasjonen Mitt Fagkart.

source: The organisation should prepare an overview of the tools, standards, and best practices that should be used during software development.
nb: Virksomheten bør utarbeide en oversikt over hvilke verktøy, standarder og beste praksis som skal brukes ved programvareutvikling.

source: example, to investigate POST requests and session cookies.
nb: å undersøke POST requests og session cookies.

source: This is described in the system documentation, and should be made available on an information page within the software.
nb: Dette er beskrevet i systemdokumentasjonen og tilgjengeliggjøres på en informasjonsside i programvaren.

source: Remove unnecessary and excessive information.
nb: Fjern unødvendig informasjon og overskuddsinformasjon.

source: The Municipality of Indre Østfold, formerly the Municipality of Askim, published the records file of a former pupil on its municipal website.
nb: Indre Østfold kommune, tidligere Askim kommune, publiserte elevmappen til en tidligere elev på kommunens nettside.

source: Long-term keys must be asymmetrical and digital certificates, and PKI must be used for key management.
nb: Langtidsnøkler skal være asymmetriske og digitale sertifikater, og PKI skal benyttes for nøkkelforvaltning.

source: These authorities may only access the SIS II data that they need for the speci­fic performance of their tasks.
nb: Disse myndighetene har bare tilgang til de opplysningene i SIS II som de trenger for å kunne utføre sine spesi­fikke oppgaver.

source: for the person responsible for product release.
nb: ansvarlig for produksjonssetting.

source: For example, is it advisable to use special categories to evaluate discrimination against them?
nb: Er det eksempelvis tilrådelig å benytte særskilte kategorier for å evaluere diskriminering mot disse?

source: - What can AI do for us?
nb: -Hva kan KI gjøre for oss?

source: This activity will enable developers to write secure code by implementing the requirements for data protection and security.
nb: Denne aktiviteten skal gjøre utviklere i stand til å skrive sikker kode ved implementering av krav for personvern og sikkerhet.

source: The company must decide for itself which requirements are relevant to their business, the software being developed, and the context in which the end product will be used.
nb: Virksomheten må selv avgjøre hvilke krav som er relevante for sin virksomhet, for programvaren som utvikles og sammenheng sluttproduktet skal brukes i.

source: The controller must be able to document compliance with the data protection regulation and security of processing.
nb: Den behandlingsansvarlige skal kunne dokumentere etterlevelse av personvernregelverket og at krav til informasjonssikkerhet er oppfylt.

source: This is done by implementing vulnerability-reducing measures, resulting in a more robust end product.
nb: Resultatet av dette er et mer herdet og robust sluttprodukt.

source: When profiling or automated decision-making of personal data are being conducted the data subject should be informed on how it is being done.
nb: Den registrerte skal ha informasjon om at profilering og automatisert behandling av personopplysninger foregår og hvordan det foregår.

source: The company must also have the capability to regularly secure, monitor, and handle incidents in the logs.
nb: I tillegg må virksomheten regelmessig sikre, overvåke og følge opp hendelser i loggene.

source: Review the Data Protection Impact Assessment (DPIA).
nb: Gå gjennom vurdering av personvernkonsekvenser (DPIA).

source: The lifespan of keys depends on the protection afforded to them.
nb: Levetid på nøkler er avhengig av beskyttelsen av disse.

source: One example might be that the user could use a menu or a separate page within the program to give and withdraw consent, allow to view, block, update, and delete their own personal data.
nb: Et eksempel er at brukeren via en meny eller en egen side i programvaren selv kan gi og fjerne samtykke, gi innsyn, blokkere, oppdatere og slette egne personopplysninger.

source: TLS 1.3 exists in draft form, and will soon be released.
nb: TLS 1.3 er i draft og kommer snart.

source: The choice you make in this category, is valid for until 90 days.
nb: Valget du tar her gjelder i inntil 90 dager.

source: This builds a foundation for the development of services customers and inhabitants can trust.
nb: Dette legger grunnlaget for utvikling av tjenester som ivaretar kunders og innbyggeres tillit.

source: “automated” tools for reviewing code for data protection are limited.
nb: «automatiserte» verktøy for kodeanalyse for personvern.

source: On this basis, we require the following information: Readability
nb: Om personopplysningsloven og krav til rettslig grunnlag

source: The plan should also contain an overview of how incidents in code inherited from third-parties should be managed.
nb: Planen bør også omfatte en oversikt over hvordan hendelser på kode arvet fra tredjepart skal håndteres.

source: For example, it may be difficult to identify patterns because data alone does not necessarily constitute personal data, but connections between different types of data can provide personal information.
nb: Det kan for eksempel være vanskelig å fange mønstre siden data alene ikke nødvendigvis er å anse som personopplysninger, men at kobling av ulike typer data kan gi personopplysninger.

source: While working on this guide, we have used Microsoft Security Development Lifecycle (SDL), Secure Software Development LifeCycle (S-SDLC) and ENISA; Privacy and Data Protection by Design – from policy to engineering, as a starting point, and explored how to incorporate data protection principles, subject rights, and the requirements of the GDPR into every step of the process.
nb: I arbeidet med denne veilederen har vi tatt utgangspunkt i Microsoft Security Development Lifecycle (SDL) og Secure Software Development LifeCycle (S-SDLC), og sett på hvordan vi kan knytte prinsipper, rettigheter og krav i personvernregelverket til hver aktivitet.

source: Special thanks go to: Dagfinn Bergsager (University of Oslo), Johannes Brodwall (Sopra Steria), Andreas Hegna (Storebrand), Karoline Klever (Microsoft), Rita Nortug (Nets), Eirik Saltkjel (Directorate of eHealth), Eskild Storvik (Capgemini).
nb: En stor takk til:Dagfinn Bergsager (UiO), Johannes Brodwall (Sopra Steria), Andreas Hegna (Storebrand), Karoline Klever (Microsoft), Rita Nortug (Nets), Eirik Saltkjel (Direktoratet for e-helse), Eskild Storvik (Capgemini).

source: modification, deletion, data portability, consent, information, transparency, etc.
nb: endring, sletting, dataportabilitet, samtykke, informasjon, åpenhet med mer.

source: The error was quickly rectified and is under control.
nb: Feila vart raskt retta og er under kontroll.

source: The software must be designed and developed so that the controller can document and demonstrate how the requirements of the data protection regulation have been implemented.
nb: Programvare skal tilrettelegges og utformes slik at den behandlingsansvarlige både kan dokumentere og vise hvordan personvernregelverket er implementert og ivaretatt.

source: To set the correct requirements, it is important to know what categories of personal data will be processed in the software, what conclusions can be drawn about individuals based on the data being processed, who is the user and owner of the data, who is defined as the controller, and if applicable, who is the data processor or recipient of the personal data.
nb: For å sette riktige krav er det viktig å vite hva slags typer personopplysninger som skal behandles i programvaren, hvilke slutninger som kan trekkes om individer på bakgrunn av informasjon som behandles, hvem som er bruker og eier av opplysningene, hvem som defineres som behandlingsansvarlig, og eventuelt hvem som er databehandler eller mottakere av personopplysningene.

source: The data protection and security requirements that were included in the test set
nb: Personvern- og sikkerhetskrav som ble satt i kravsetting skal være implementert, og riktig

source: This includes routines for risk assessment and requirements for documentation.
nb: Det inkluderer rutiner for risikovurderinger og krav til dokumentasjon.

source: One option is to transmit the key as a text message or orally over the telephone.
nb: Et alternativ er å sende nøkkelen som SMS eller muntlig over telefon.

source: expect digital services and products that are tailored specifically
nb: Ved å ha best mulig innsikt i brukernes atferd og inter-esser, skaper de produkter som er:

source: The law requires NAV to conduct dialogue meetings with sick leavers, their doctor and employer within week 26.
nb: Loven pålegger NAV å gjennomføre dialogmøter med sykmeldt, sykmelder og arbeidsgiver innen uke 26.

source: Examples include 7zip, PDF or more recent versions of MS Office.
nb: Eksempler på dette er 7zip, PDF eller MS Office av nyere sort.

source: authority, the Irish Data Protection Commissioner, or
nb: ledelsen ikke anser at behandlingen av

source: Access to SIS II is limited to the national law enforcement, judicial and administrative authorities.
nb: Tilgang til SIS II er begrenset til nasjonale politimyndigheter, rettsmyndigheter og administrative myndigheter.

source: The duration of sandbox participation will vary from project to project, but we believe a project period of 3 to 6 months in the sandbox is appropriate.
nb: Varigheten på oppholdet i sandkassen kan variere fra prosjekt til prosjekt, men i utgangspunktet ser vi for oss at prosjekter deltar i sandkassen i en periode på 3 til 6 måneder.

source: How to handle incidents and data breaches?
nb: Hvordan håndtere hendelser og avvik?

source: is stored (e.g., backup).
nb: steder der de er lagret (eksempelvis backup).

source: The organisation should operate an incident response plan.
nb: Virksomheten bør følge en plan for hendelseshåndtering.

source: Keys can be created in software (for personal use) for data communication (data in transit).
nb: Nøkler kan lages i software (for eget bruk) for datakommunikasjon (data in transit).

source: Then it is difficult, if not impossible, to reverse the damage.
nb: Da er det vanskelig, om ikke umulig, å reversere skaden.

source: Who has access to the information in VIS?
nb: Hvem har tilgang til informasjonen i VIS?

source: This vulnerability in the voicemail function had been known for many years.
nb: - Vi har vært nødt til å gjøre dette i skjul, sier Bjørn Erik Thon, direktør i Datatilsynet.

source: When developing software that processes personal data, the methodology should include data protection by design and by default, and security by design.
nb: Ved utvikling av programvare som behandler personopplysninger, skal metodikken omfatte innebygd personvern og innebygd sikkerhet.

source: Such a security test must be a legal and authorised attempt to find, exploit, and detect vulnerabilities.
nb: Slike sikkerhetstester skal være lovlige og autoriserte forsøk påå finne, utnytte og avdekke sårbarheter.

source: Use approved tools and frameworks
nb: Bruk godkjente verktøy og rammer

source: Age Labs is in the FoU stage of its first diagnostic test for rheumatological disease, and in the sandbox project they will focus on the possibility of anonymizing, possibly pseudonymizing, health data that is necessary for this particular test.
nb: Age Labs er i FoU-stadiet for sin første diagnostiske test for revmatologisk sykdom, og i sandkasseprosjektet vil de fokusere på muligheten for å anonymisere, eventuelt pseudonymisere, helsedata som er nødvendige for akkurat denne testen.

source: The AI-projects for the first round in the sandbox was announced early March 2021.
nb: KI-prosjektene for den første runden i sandkassa ble valgt ut i starten av mars 2021.

source: The target group for this activity is management and employees in the organisation.
nb: Målgruppen for denne fasen er ledelse og ansatte i virksomheten.

source: For example, do the channels adequately safeguard the security of the contents of messages, and the privacy of those making the reports?
nb: Ivaretar kanalene for eksempel sikkerheten til innholdet i meldingen og personvernet til den som rapporterer godt nok?

source: Use multiple approaches and channels to ensure that you reach all users and user
nb: Bruk flere tilnærminger og kanaler for å sikre at man når frem til alle brukere og

source: As a follow-up, you should carry out a risk assessment of any vulnerabilities that remain, and which must be mitigated using other measures.
nb: Som oppfølging bør det gjøres en risikovurdering av sårbarheter som gjenstår og som må håndteres ved andre tiltak.

source: Versions will be built for testing, and a release owner will be appointed.
nb: Det bygges versjoner for testing og det settes en eier for produksjonssetting.

source: In the current situation, the NAV supervisors must already in week 17 assess whether there will be a need for such a meeting, in practice try to predict whether the sick leaver is back at work or not nine weeks later.
nb: I dagens situasjon må NAV-veilederen allerede i uke 17 vurdere om det kommer til å bli behov for et slikt møte, i praksis prøve å spå om den sykmeldte er tilbake i jobb eller ikke ni uker senere.

source: The plan should contain a regime for patching the software that includes policy and follow-up.
nb: Planen bør omfatte et regime for patching av programvaren som inkluderer policy og oppfølging.

source: Violation of Article 33 of the GDPR, by failing to notify the personal data breach to the Data Protection Authority.
nb: Brudd på personvernforordningen artikkel 33, for manglende melding til Datatilsynet om brudd på personopplysningssikkerheten (avviksmelding).

source: The third main principle for responsible artificial intelligence is, as mentioned above, that it needs to be
nb: Det tredje hovedprinsippet i ansvarlig kunstig intelligens er som nevnt at den skal være

source: Encryption and access control are examples of measures that can be used to help ensure security.
nb: Kryptering og tilgangsstyring er eksempler på tiltak som kan bidra til å ivareta sikkerheten.

source: Be sure to document the analysis and the reduction of the attack surface.
nb: Sørg for å dokumentere analysen og reduksjonen av angrepsflaten.

source: transparency in our assessments of the
nb: Vi mener at Facebooks behandling av

source: The information can also be exported to a file or paper version for manual review with a corresponding procedure allowing the data subject to correct, block, or delete data (within 30 days)
nb: Informasjonen kan også eksporteres til en fil eller papirversjon for manuell gjennomgang med en tilhørende rutine for at den registrerte skal kunne rette, blokkere eller slette opplysninger (innen 30 dager).

source: The testing will ensure that users only have access to the information and functionality that they are authorised for.
nb: Testingen skal sikre at brukerne kun får tilgang til den informasjonen og funksjonaliteten de har rettigheter til.

source: Relevant requirements for data protection and security are contained in the data protection regulation, business practices and policies for data protection and information security, various security standards, and codes of conduct or other relevant laws and regulations relating to the sector.
nb: Relevante personvern- og sikkerhetskrav finnes i personopplysningsloven, virksomhetens rutiner og retningslinjer for personvern og informasjonssikkerhet, ulike sikkerhetsstandarder, atferdsnormer (bransjenormer) eller andre relevante lovverk og føringer knyttet til sektoren.

source: The documentation should cover accountability and how the data protection regulation is enforced.
nb: Dokumentasjonen bør omfatte ansvarsforhold og hvordan personvernregelverket håndheves.

source: For example, public enterprises must comply with requirements laid down in the Archives Act, Public Administration Act, and the Freedom of Information Act — to name a few.
nb: Offentlige virksomheter må for eksempel forholde seg til krav fra arkivlovgivningen, forvaltningsloven og offentlighetsloven – for å nevne noen.

source: Hide and protect.
nb: Gjem og skjul.

source: particularly for security purposes and commercial
nb: Sporing av enkeltmenneskers tilstedeværelse og handlinger kan aggregeres til statistikk.

source: , an incident response plan should be established, and a full security review of the software should be carried out.
nb: Før produksjonssetting bør en plan for hendelseshåndtering etableres og det bør gjøres en full sikkerhetsgjennomgang av programvaren.

source: The Norwegian Data Protection Authority can order the safeguarding of personal data and determine the criteria for acceptable risk associated with the processing of personal information.
nb: Datatilsynet kan gi pålegg om sikring av personopplysninger og fastlegge kriterier for akseptabel risiko forbundet med behandlingen av personopplysninger.

source: Separation is also an effective means to achieve purpose limitation and to avoid linkability between different data sets.
nb: Separasjon er også en god måte å oppnå formålsbegrensning og for å unngå urettmessig kobling og lenking mellom ulike datasett.

source: o security tests (such as vulnerability analysis and penetration testing,
nb: o sikkerhetstester (slik som sårbarhetsanalyser og penetrasjonstester, fortløpende

source: Different groups of experts should be involved in each security review, to ensure the best possible review of different scenarios and consequences, as well as the best possible quality of any measures implemented as a result.
nb: Ulike ekspertgrupper bør involveres i sikkerhetsgjennomgangen for å sikre en best mulig gjennomgang av ulike scenarier og konsekvenser, og best mulig kvalitet på eventuelle tiltak som implementeres.

source: methodologies for o identifying and removing vulnerabilities in the code o using automated tools for code analysis o static code analysis and review
nb: o koding o å oppdage og fjerne sårbarheter fra koden o bruk av automatiske verktøy for kodeanalyse o statisk kodeanalyse og kodegjennomgang

source: The municipal sector's organization, KS, is behind the project AVT2 together with the Education Agency in Oslo and the Center for Science of Learning & Technology (SLATE) at UiB.
nb: Kommunesektorens organisasjon, KS, står bak prosjektet AVT2 sammen med Utdanningsetaten i Oslo og Centre for Science of Learning & Technology (SLATE) ved UiB.

source: It should support multiple levels (different programming languages and platforms).
nb: Det støtter flere nivåer (ulike programmeringsspråk og plattformer).
